[
  {
    "level": "1M",
    "code": "OA01",
    "description": "Formular preguntas que orienten una indagación sobre temas del mundo contemporáneo o de la historia reciente de Chile, delimitando el ámbito y el periodo a investigar."
  },
  {
    "level": "1M",
    "code": "OA02",
    "description": "Analizar causas y consecuencias de distintos procesos económicos, políticos, sociales y culturales del mundo contemporáneo, utilizando diversos tipos de fuentes, como textos historiográficos, estadísticas, fuentes audiovisuales y gráficos."
  },
  {
    "level": "1M",
    "code": "OA03",
    "description": "Explicar el proceso de construcción del Estado nacional en Chile en el siglo XIX, considerando las principales características de la organización política, las instituciones republicanas, la consolidación territorial y las tensiones entre proyectos conservadores y liberales."
  },
  {
    "level": "1M",
    "code": "OA04",
    "description": "Caracterizar las transformaciones económicas y sociales ocurridas en Chile durante el siglo XIX, considerando la organización de la economía exportadora, los cambios demográficos, el impacto de la urbanización y la cuestión social a fines del siglo."
  },
  {
    "level": "1M",
    "code": "OA05",
    "description": "Analizar los principales procesos y conflictos internacionales de la primera mitad del siglo XX, incluyendo la Primera Guerra Mundial, la crisis económica de 1929, el totalitarismo, la Segunda Guerra Mundial y sus repercusiones en Chile y América Latina."
  },
  {
    "level": "1M",
    "code": "OA06",
    "description": "Explicar los principales procesos políticos y sociales en Chile durante la primera mitad del siglo XX, incluyendo la conformación de movimientos sociales, la consolidación de partidos políticos de masas, la cuestión social y las transformaciones económicas."
  },
  {
    "level": "1M",
    "code": "OA07",
    "description": "Analizar los cambios geopolíticos del mundo a partir de la segunda mitad del siglo XX hasta la actualidad, considerando la Guerra Fría, los procesos de descolonización, la globalización y sus implicancias."
  },
  {
    "level": "1M",
    "code": "OA08",
    "description": "Describir la transformación de Chile en la segunda mitad del siglo XX, incluyendo las políticas de industrialización, el quiebre democrático de 1973, el régimen militar, la recuperación de la democracia y los desafíos del Chile actual."
  },
  {
    "level": "1M",
    "code": "OA09",
    "description": "Analizar problemas ambientales y territoriales contemporáneos (como la contaminación, el cambio climático, la urbanización, la escasez hídrica) a escala global, regional y local, comprendiendo sus causas y las estrategias de mitigación y adaptación."
  },
  {
    "level": "1M",
    "code": "OA10",
    "description": "Investigar colaborativamente un problema o tema del mundo actual o de la historia reciente, aplicando habilidades de indagación social y comunicando los hallazgos de manera oral, escrita o multimodal."
  },
  {
    "level": "1M",
    "code": "OAA A",
    "description": "Demostrar interés y curiosidad por comprender los procesos históricos y geográficos, reconociendo su importancia para la formación de una visión crítica del presente."
  },
  {
    "level": "1M",
    "code": "OAA B",
    "description": "Respetar la diversidad de interpretaciones históricas y perspectivas culturales, valorando el diálogo informado y el debate fundamentado sobre temas sociales."
  },
  {
    "level": "1M",
    "code": "OAA C",
    "description": "Manifestar rigurosidad y honestidad en la investigación histórica y social, dando crédito a las fuentes de información y evitando el plagio o la tergiversación de datos."
  },
  {
    "level": "1M",
    "code": "OAA D",
    "description": "Valorar el patrimonio natural y cultural, reconociendo la necesidad de su preservación y la responsabilidad individual y colectiva en su cuidado."
  },
  {
    "level": "2M",
    "code": "OA01",
    "description": "Formular preguntas para investigar temas relevantes de la historia de Chile y América en los siglos XIX y XX, delimitando claramente el foco temporal y espacial de la indagación."
  },
  {
    "level": "2M",
    "code": "OA02",
    "description": "Analizar las causas y consecuencias de procesos y conflictos mundiales del siglo XX (Guerra Fría, descolonización, globalización), utilizando fuentes históricas variadas (documentos, testimonios, datos estadísticos)."
  },
  {
    "level": "2M",
    "code": "OA03",
    "description": "Explicar la evolución política de Chile en el siglo XX, considerando períodos como el parlamentarismo, los proyectos de modernización, el quiebre democrático de 1973, el régimen autoritario y la transición a la democracia."
  },
  {
    "level": "2M",
    "code": "OA04",
    "description": "Caracterizar los cambios económicos y sociales en Chile durante el siglo XX, incluyendo el proceso de industrialización, las reformas agraria y educativa, los movimientos sociales y el impacto del modelo neoliberal."
  },
  {
    "level": "2M",
    "code": "OA05",
    "description": "Analizar la situación geopolítica y económica de Chile en la actualidad, en el contexto latinoamericano y global: inserción en mercados internacionales, políticas regionales, participación en organismos globales, desafíos sociales y ambientales."
  },
  {
    "level": "2M",
    "code": "OA06",
    "description": "Explicar procesos democráticos y de ciudadanía en Chile post-1990, incluyendo reformas institucionales, rol de la sociedad civil, avances en derechos humanos y desafíos pendientes en igualdad y participación."
  },
  {
    "level": "2M",
    "code": "OA07",
    "description": "Describir problemáticas territoriales contemporáneas de Chile (centralización, migración campo-ciudad, conflictos ambientales y étnicos), analizando sus causas históricas y proponiendo alternativas de solución."
  },
  {
    "level": "2M",
    "code": "OA08",
    "description": "Elaborar una investigación colaborativa sobre un problema del Chile actual (desigualdad, medio ambiente, diversidad cultural, etc.), aplicando métodos de las ciencias sociales y presentando conclusiones sustentadas en evidencia."
  },
  {
    "level": "2M",
    "code": "OA09",
    "description": "Evaluar las consecuencias locales de fenómenos globales actuales (cambio climático, migraciones, crisis económicas, pandemias) y discutir cómo Chile se ve afectado y responde a estos desafíos."
  },
  {
    "level": "2M",
    "code": "OA10",
    "description": "Debatir sobre la importancia de la memoria histórica y los derechos humanos en la sociedad chilena, a partir del análisis de experiencias del siglo XX (dictadura, violencia política, reconciliación nacional)."
  },
  {
    "level": "2M",
    "code": "OAA A",
    "description": "Mostrar espíritu crítico y reflexivo frente a las narrativas históricas oficiales, indagando diversas fuentes y perspectivas para formarse una opinión informada."
  },
  {
    "level": "2M",
    "code": "OAA B",
    "description": "Comprometerse con valores democráticos y de respeto a los derechos humanos, reconociendo su importancia en la convivencia social y política."
  },
  {
    "level": "2M",
    "code": "OAA C",
    "description": "Participar de manera constructiva en discusiones sobre problemas del país, escuchando opiniones distintas y argumentando con base en datos y evidencias."
  },
  {
    "level": "2M",
    "code": "OAA D",
    "description": "Valorar el patrimonio cultural y natural de Chile, mostrando interés por su preservación y difusión."
  }
]