[
  {
    "level": "1M",
    "code": "OA01",
    "description": "Demostrar comprensión de ideas generales e información explícita en textos orales adaptados y auténticos simples, literarios y no literarios, en diversos formatos audiovisuales (como exposiciones orales, conversaciones, descripciones, instrucciones y procedimientos, avisos publicitarios, entrevistas, noticieros, anécdotas, narraciones, canciones), acerca de temas variados (experiencias personales, temas de otras asignaturas, del contexto inmediato, de actualidad e interés global o de otras culturas) y que contienen las funciones del año."
  },
  {
    "level": "1M",
    "code": "OA02",
    "description": "Identificar palabras, frases y expresiones clave, expresiones idiomáticas de uso más recurrente, combinaciones frecuentes de palabras (collocations), vocabulario temático, conectores (later, last, so that, although, both y los del año anterior), sonidos vocales largos y cortos (feet/fit), combinaciones iniciales /tr/ y /dr/ (tree/dress), sonido inicial /j/ (year, yes) y sonido final -tion /ʃ/ (como en vacation) en textos orales en diversos formatos o al participar en interacciones cotidianas y conversaciones en la clase."
  },
  {
    "level": "1M",
    "code": "OA03",
    "description": "Identificar en los textos escuchados:\n- Propósito o finalidad del texto, tema e ideas relevantes.\n- Ideas generales en textos sobre temas menos conocidos.\n- Información específica y detalles clave asociados a personas, sus acciones y opiniones, lugares, tiempo, hablantes y situaciones.\n- Relaciones de contraste y problema-solución entre ideas."
  },
  {
    "level": "1M",
    "code": "OA04",
    "description": "Seleccionar y usar estrategias para apoyar la comprensión de los textos escuchados:\n- Hacer predicciones.\n- Escuchar con un propósito.\n- Usar conocimientos previos.\n- Hacer inferencias con el apoyo de claves contextuales (tema, participantes, apoyo visual) y pistas fonológicas (entonación, acentuación).\n- Focalizar la atención en expresiones o frases clave.\n- Utilizar apoyos como gestos del hablante y entonación.\n- Pedir repetición o clarificación en interacciones.\n- Confirmar predicciones.\n- Resumir algunas ideas relevantes con apoyo.\n- Preguntar para confirmar comprensión."
  },
  {
    "level": "1M",
    "code": "OA05",
    "description": "Presentar información en forma oral, usando recursos multimodales que refuercen el mensaje en forma creativa acerca de temas variados (como experiencias personales, temas de otras asignaturas, otras culturas, problemas globales y contingentes) tratando cada uno con profundidad, utilizando vocabulario relevante, estructuras sintácticas variadas y los sonidos del inglés en forma clara."
  },
  {
    "level": "1M",
    "code": "OA06",
    "description": "Participar activa y coherentemente en conversaciones, discusiones y exposiciones simples acerca de diversos temas (como experiencias personales, temas de otras asignaturas, cultura e intereses globales, problemas de actualidad), incorporando funciones del lenguaje apropiadas a la situación (por ejemplo, expresar opiniones, estar de acuerdo o en desacuerdo, pedir aclaraciones, etc.) y aplicando estrategias para mantener la comunicación (como verificar comprensión, dar retroalimentación a sus interlocutores, etc.)."
  },
  {
    "level": "1M",
    "code": "OA07",
    "description": "Demostrar comprensión de ideas principales y detalles en textos escritos adaptados y auténticos simples, literarios y no literarios (como infografías, correos electrónicos, artículos informativos, reseñas breves, descripciones, instrucciones, noticias, cuentos breves), acerca de temas conocidos y de relevancia para los estudiantes, que contengan vocabulario temático, expresiones idiomáticas frecuentes, conectores básicos (first, then, finally, because, so, but, however, etc.) y las funciones del año."
  },
  {
    "level": "1M",
    "code": "OA08",
    "description": "Aplicar estrategias de comprensión lectora, como predecir el contenido de un texto a partir de sus características paratextuales, releer, identificar cognados, inferir el significado de palabras por el contexto, usar un diccionario bilingüe, confirmar predicciones, resumir información, entre otras."
  },
  {
    "level": "1M",
    "code": "OA09",
    "description": "Escribir, con distintos propósitos (por ejemplo, para describir, narrar, informar, resumir), textos breves de estructura simple, sobre temas cotidianos o de interés, usando vocabulario temático, expresiones de uso frecuente, conectores básicos (and, but, or, because, then, so, etc.) y patrones sintácticos estudiados, aplicando convenciones ortográficas y de puntuación."
  },
  {
    "level": "1M",
    "code": "OA10",
    "description": "Revisar y editar sus escritos breves con la ayuda del docente u otros estudiantes, enfocándose en aspectos formales (como ortografía, puntuación, tiempos verbales y vocabulario) y globales (como la organización de ideas y la coherencia del texto), utilizando estrategias de autocorrección (como leer en voz alta lo escrito, usar procesador de texto) y recursos de apoyo (como diccionarios bilingües en línea o en papel)."
  },
  {
    "level": "1M",
    "code": "OAA A",
    "description": "Tener una actitud positiva y segura frente al aprendizaje del idioma inglés, valorando sus avances y participando activamente en situaciones comunicativas."
  },
  {
    "level": "1M",
    "code": "OAA B",
    "description": "Demostrar perseverancia y esfuerzo en la adquisición de la lengua inglesa, enfrentando desafíos lingüísticos con interés y curiosidad."
  },
  {
    "level": "1M",
    "code": "OAA C",
    "description": "Mostrar respeto y tolerancia ante la diversidad lingüística y cultural al interactuar en inglés, reconociendo la riqueza que aportan distintas culturas."
  },
  {
    "level": "1M",
    "code": "OAA D",
    "description": "Valorar la importancia de aprender inglés como herramienta para acceder a información global, comunicarse con personas de otros países y comprender otras realidades."
  },
  {
    "level": "2M",
    "code": "OA01",
    "description": "Demostrar comprensión de ideas generales e información explícita en textos orales adaptados y auténticos más complejos, literarios y no literarios, en diversos formatos audiovisuales (charlas, conversaciones, descripciones, instrucciones, noticias, películas) sobre temas de interés global y académico, que incluyan las funciones del lenguaje estudiadas."
  },
  {
    "level": "2M",
    "code": "OA02",
    "description": "Identificar palabras clave, expresiones idiomáticas comunes, colocaciones (collocations), vocabulario temático avanzado, conectores discursivos (however, although, on the other hand, etc.) y patrones sonoros (contraste de vocales largas y cortas, combinaciones consonánticas) al escuchar interacciones y textos orales en inglés."
  },
  {
    "level": "2M",
    "code": "OA03",
    "description": "Identificar en textos orales:\n- Propósito del hablante y tema central.\n- Ideas principales y secundarias incluso en contextos menos familiares.\n- Detalles específicos sobre personajes, acciones, opiniones y contextos.\n- Relaciones causa-efecto y problema-solución entre ideas presentadas."
  },
  {
    "level": "2M",
    "code": "OA04",
    "description": "Seleccionar y aplicar estrategias de comprensión auditiva adecuadas a textos más complejos:\n- Hacer inferencias apoyándose en contexto y entonación.\n- Tomar apuntes breves de lo escuchado.\n- Comprobar hipótesis a medida que avanza la escucha.\n- Escuchar en busca de información específica.\n- Autopreguntarse sobre lo comprendido y clarificar."
  },
  {
    "level": "2M",
    "code": "OA05",
    "description": "Presentar información y opiniones de forma oral sobre temas variados (culturales, científicos, cotidianos), apoyándose en recursos multimodales innovadores, con coherencia y dominio de estructuras gramaticales y pronunciación clara."
  },
  {
    "level": "2M",
    "code": "OA06",
    "description": "Participar en conversaciones y discusiones sobre temas de interés y actualidad, adecuando el registro (formal/informal), respetando turnos, haciendo preguntas de clarificación, expresando acuerdo o discrepancia fundamentada y manteniendo la interacción."
  },
  {
    "level": "2M",
    "code": "OA07",
    "description": "Demostrar comprensión de ideas principales, detalles e inferencias en textos escritos adaptados y auténticos de extensión moderada (artículos, relatos, ensayos breves) sobre temas familiares y algunos menos conocidos, con vocabulario y estructuras propias del nivel."
  },
  {
    "level": "2M",
    "code": "OA08",
    "description": "Emplear estrategias de comprensión lectora en textos más extensos o complejos:\n- Predecir contenido con mayor autonomía.\n- Inferir significado de palabras desconocidas por contexto o morfología (prefijos/sufijos).\n- Relacionar información de distintas partes del texto.\n- Resumir pasajes enfatizando ideas centrales."
  },
  {
    "level": "2M",
    "code": "OA09",
    "description": "Escribir textos cohesionados (relatos, informes breves, ensayos cortos, cartas formales e informales) adecuados a su propósito comunicativo, usando variedad de vocabulario, frases idiomáticas básicas, conectores (in addition, therefore, on the contrary, etc.) y estructuras sintácticas estudiadas, con ortografía y puntuación mayormente correctas."
  },
  {
    "level": "2M",
    "code": "OA10",
    "description": "Revisar y corregir sus escritos, de manera cada vez más autónoma o con retroalimentación de pares, focalizándose tanto en aspectos globales (claridad, coherencia, registro adecuado) como locales (gramática, ortografía, léxico preciso), usando herramientas como revisores ortográficos y guías de autoevaluación."
  },
  {
    "level": "2M",
    "code": "OAA A",
    "description": "Manifestar confianza creciente en el uso del inglés, atreviéndose a comunicarse a pesar de las dificultades, y valorando sus avances."
  },
  {
    "level": "2M",
    "code": "OAA B",
    "description": "Mostrar iniciativa en la práctica y aprendizaje del inglés fuera del aula (escuchando música, viendo películas, leyendo en inglés), evidenciando motivación intrínseca."
  },
  {
    "level": "2M",
    "code": "OAA C",
    "description": "Respetar las contribuciones de sus compañeros en actividades comunicativas en inglés, fomentando un ambiente de apoyo y colaboración."
  },
  {
    "level": "2M",
    "code": "OAA D",
    "description": "Apreciar el aprendizaje del inglés como medio para ampliar sus horizontes culturales, académicos y profesionales, y demostrar compromiso con su progreso."
  }
]